app/Controllers/Emple.php

    public function index() {

        $Suc = $this->Suc->orderBy("Idsucursal","asc")->findAll();
        $Ptos = $this->Ptos->orderBy("Idpuesto","asc")->findAll();
        $Empl = $this->Empl->join('puestos pt', 'pt.Idpuesto = empleados.Idpuesto')->join('sucursales sc', 'sc.Idsucursal = empleados.Idsucursal')->orderBy("Idempleado","asc")->findAll();
---
SELECT *
FROM `puestos`
ORDER BY `Idpuesto` ASC
SELECT *
FROM `empleados`
JOIN `puestos` `pt` ON `pt`.`Idpuesto` = `empleados`.`Idpuesto`
JOIN `sucursales` `sc` ON `sc`.`Idsucursal` = `empleados`.`Idsucursal`
ORDER BY `Idempleado` ASC